[
{ "msgs": ["Hey, what are you doing? Are you feeling sleepy? If you are, I don't care! Wakey wakey, eggs and bakey, pay attention!"], "msgInputSpeed": 80 },
{
"msgs": ["I wanna spill the beans, spill the tea, spill the guts, spill the whole enchilada"],
"msgInputSpeed": 80,
"triggerNextAction": {
"type": "userInput",
"options": {
"resolveKeyTexts": ["Say"],
"rejectKeyTexts": [],
"rejectHitTexts": [
"Okay, listen up buttercup! I gotta tell ya, you're freakin' amazing. I say it all the time, but seriously, you need to understand this once and for all! You're so damn important to me!",
"Meeting you was the best damn thing that ever happened to me, man. And I want you to feel as awesome as you make me feel! I don't know how to make it sound all nice and sweet, so you might think I'm being extra. Sorry not sorry, I don't give a flying fudge!",
"Look man, I know lately you haven't been feeling great, or maybe you're thinking your life sucks big time. But let me tell you, mine ain't no bed of roses either. Screw this crap, right? But hey, we can be two hot messes together and make the best of this dumpster fire of a world. You're always so damn closed off, I'm gonna hack my way in like the 'I Love You' virus in 2000."
]
}
}
},
{
"msgs": ["You know what I'm craving right now?"],
"msgInputSpeed": 80,
"triggerNextAction": {
"type": "userInput",
"options": {
"resolveKeyTexts": ["Thinking of me", "me"],
"rejectKeyTexts": ["Thinking of nothing"],
"rejectHitTexts": [
"Come on, you know what I'm thinking and wanting! Duh!",
"Hey hey, hold up! That answer is totally whack, folks! (in Ratinho's voice)"
]
}
}
},
{
"msgs": ["Of course I'm thinking about your body on top of mine in a naughty way", "Of course I'm thinking about you in a sweet and loving way."],
"msgInputSpeed": 80
},
{ "msgs": ["Don't believe me? Well, you should! (I really hope you're responding the way my imagination thinks you are)"], "msgInputSpeed": 100 },
{ "msgs": ["I've got your first present right here, baby!"], "msgInputSpeed": 140 },
{ "msgs": ["Unfortunately, it's not me personally (but hey, maybe you would run away if it was!)"], "msgInputSpeed": 180 },
{ "msgs": ["I'm kidding, okay?! Or am I? But I'm not saying anything!”], "msgInputSpeed": 80 },
{ "msgs": ["The present is on its way, but I'm not! KKKKKKKry!"], "msgInputSpeed": 80 },
{
"msgs": ["I talk a lot, but I'll always have something to say to you. Maybe you're already thinking, “Oh my god, shut up already! I'm avoiding the subject by pretending to be slow!"],
"msgInputSpeed": 80
},
{
"msgs": ["<letter src='options/preview/letter.json'/>"],
"triggerNextAction": { "type": "componentClose" }
},
{ "msgs": ["Okay, was that too long? Did I talk too much? Sorry! But just know that...
E|------------------------|
B|------------------------|
G|------------------------|
D|-----------4-5-7--------|
A|-----5-7-8--------------|
E|--5-7--------------------|"] },
{ "msgs": ["<img src='options/preview/感动到哭.png'/>"] },
{ "msgs": ["Demonstração concluída..."], "msgInputSpeed": 80 }
]
